{
  "name": "Entry",
  "parent": "File",
  "properties": [
    {
      "name": "isFile",
      "description": "Entry is a file.",
      "type": "boolean",
      "optional":false
    },
    {
      "name": "isDirectory",
      "description": "Entry is a directory.",
      "type": "boolean",
      "optional":false
    },
    {
      "name": "getMetadata",
      "description": "Look up metadata about this entry.",
      "type": "void",
      "optional":false
    },
    {
      "name": "setMetadata",
      "description": "Set the metadata of the entry.",
      "type": "void",
      "optional":false
    },
    {
      "name": "name",
      "description": "The name of the entry, excluding the path leading to it.",
      "type": "string",
      "optional":false
    },
    {
      "name": "fullPath",
      "description": "The full absolute path from the root to the entry.",
      "type": "string",
      "optional":false
    },
    {
      "name": "filesystem",
      "description": "The file system on which the entry resides.",
      "type": "FileSystem",
      "optional":false
    },
    {
      "name": "nativeURL",
      "description": "an alternate URL which can be used by native webview controls, for example media players.",
      "type": "string",
      "optional":false
    },
    {
      "name": "moveTo",
      "description": "Move an entry to a different location on the file system. It is an error to try to:<ui><li>move a directory inside itself or to any child at any depth;</li><li>move an entry into its parent if a name different from its current one isn't provided;</li><li>move a file to a path occupied by a directory;</li><li>move a directory to a path occupied by a file;</li><li>move any element to a path occupied by a directory which is not empty.</li><ul>A move of a file on top of an existing file must attempt to delete and replace that file.A move of a directory on top of an existing empty directory must attempt to delete and replace that directory.",
      "type": "void",
      "optional":false
    },
    {
      "name": "copyTo",
      "description": "Copy an entry to a different location on the file system. It is an error to try to:<ul><li> copy a directory inside itself or to any child at any depth;</li><li> copy an entry into its parent if a name different from its current one isn't provided;</li><li> copy a file to a path occupied by a directory;</li><li> copy a directory to a path occupied by a file;</li><li> copy any element to a path occupied by a directory which is not empty.</li><li> A copy of a file on top of an existing file must attempt to delete and replace that file.</li><li> A copy of a directory on top of an existing empty directory must attempt to delete and replace that directory.</li></ul>Directory copies are always recursive--that is, they copy all contents of the directory.",
      "type": "void",
      "optional":false
    },
    {
      "name": "toURL",
      "description": "Returns a URL that can be used to identify this entry. Unlike the URN defined in [FILE-API-ED], it has no specific expiration; as it describes a location on disk, it should be valid at least as long as that location exists.",
      "type": "string",
      "optional":false
    },
    {
      "name": "toInternalURL",
      "description": "Return a URL that can be passed across the bridge to identify this entry.",
      "type": "string",
      "optional":false
    },
    {
      "name": "remove",
      "description": "Deletes a file or directory. It is an error to attempt to delete a directory that is not empty. It is an error to attempt to delete the root directory of a filesystem.",
      "type": "void",
      "optional":false
    },
    {
      "name": "getParent",
      "description": "Look up the parent DirectoryEntry containing this Entry. If this Entry is the root of its filesystem, its parent is itself.",
      "type": "void",
      "optional":false
    }
  ]
}
