{
  "name": "ThreeDeeTouch",
  "members": [
    {
      "name": "isAvailable",
      "description": "You need an iPhone 6S or some future tech to use the features of this plugin, so you can check at runtime if the user's device is supported.",
      "params": [
      ]
    },
    {
      "name": "watchForceTouches",
      "description": "You can get a notification when the user force touches the webview. The plugin defines a Force Touch when at least 75% of the maximum force is applied to the screen. Your app will receive the x and y coordinates, so you have to figure out which UI element was touched.",
      "params": [
      ]
    },
    {
      "name": "configureQuickActions",
      "description": "setup the 3D-touch actions, takes an array of objects with the following",
      "params": [
        {
          "name": "type",
          "description": "(optional) A type that can be used `onHomeIconPressed` callback",
          "type": "string",
          "optional": false
        },
        {
          "name": "title",
          "description": "Title for your action",
          "type": "string",
          "optional": false
        },
        {
          "name": "subtitle",
          "description": "(optional) A short description for your action",
          "type": "string",
          "optional": false
        },
        {
          "name": "iconType",
          "description": "(optional) Choose between Prohibit, Contact, Home, MarkLocation, Favorite, Love, Cloud, Invitation, Confirmation, Mail, Message, Date, Time, CapturePhoto, CaptureVideo, Task, TaskCompleted, Alarm, Bookmark, Shuffle, Audio, Update",
          "type": "string",
          "optional": false
        },
        {
          "name": "iconTemplate",
          "description": "(optional) Can be used to provide your own icon",
          "type": "string",
          "optional": false
        }
      ]
    },
    {
      "name": "onHomeIconPressed",
      "description": "When a home icon is pressed, your app launches and this JS callback is invoked.",
      "params": [
      ]
    },
    {
      "name": "enableLinkPreview",
      "description": "Enable Link Preview.UIWebView and WKWebView (the webviews powering Cordova apps) don't allow the fancy new link preview feature of iOS9.",
      "params": [
      ]
    },
    {
      "name": "disableLinkPreview",
      "description": "Disabled the link preview feature, if enabled.",
      "params": [
      ]
    }
  ]
}
